samples/ITI-47_response_raw.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
 <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <wsa:Action xmlns:mustUnderstand="http://www.w3.org/2003/05/soap-envelope" mustUnderstand:mustUnderstand="1">urn:hl7-org:v3:PRPA_IN201306UV02</wsa:Action>
  <wsa:RelatesTo>urn:uuid:cf11d39c-8a2e-4683-bbe6-9f2b6f63f8c0</wsa:RelatesTo>
 </soapenv:Header>
 <soapenv:Body>
  <ns1:PRPA_IN201306UV02 xmlns:ns1="urn:hl7-org:v3" ITSVersion="XML_1.0">
   <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.2.3.4.5" extension="30"/>
   <ns1:creationTime xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:TS" value="20200922105735"/>
   <ns1:versionCode code="V3PR1"/>
   <ns1:interactionId xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="2.16.840.1.113883" extension="PRPA_IN201306UV02"/>
   <ns1:processingCode code="P"/>
   <ns1:processingModeCode code="T"/>
   <ns1:acceptAckCode code="NE"/>
   <ns1:receiver typeCode="RCV">
    <ns1:device classCode="DEV" determinerCode="INSTANCE">
     <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.2017.2.5.55"/>
    </ns1:device>
   </ns1:receiver>
   <ns1:sender typeCode="SND">
    <ns1:device classCode="DEV" determinerCode="INSTANCE">
     <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.2017.2.4.105"/>
    </ns1:device>
   </ns1:sender>
   <ns1:acknowledgement>
    <ns1:typeCode code="AA"/>
    <ns1:targetMessage>
     <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="2.16.840.1.113883.1.6.1" extension="1.21600765055487"/>
    </ns1:targetMessage>
   </ns1:acknowledgement>
   <ns1:controlActProcess classCode="CACT" moodCode="EVN">
    <ns1:code xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:CD" code="PRPA_TE201306UV02"/>
    <ns1:subject typeCode="SUBJ" contextConductionInd="false">
     <ns1:registrationEvent classCode="REG" moodCode="EVN">
      <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" nullFlavor="NA"/>
      <ns1:statusCode code="active"/>
      <ns1:subject1 typeCode="SBJ">
       <ns1:patient classCode="PAT">
        <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.2017.2.5.36" extension="TIE4873"/>
        <ns1:statusCode code="active"/>
        <ns1:patientPerson classCode="PSN" determinerCode="INSTANCE">
         <ns1:name xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:PN">
          <ns1:given>Alice</ns1:given>
          <ns1:family>Maiden</ns1:family>
         </ns1:name>
         <ns1:administrativeGenderCode code="F"/>
         <ns1:birthTime xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:TS" value="19880101"/>
         <ns1:addr xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:AD" use="HP">
          <ns1:city>Pontarlier</ns1:city>
          <ns1:postalCode>25300</ns1:postalCode>
          <ns1:streetName>Ruelle de la Tour</ns1:streetName>
         </ns1:addr>
         <ns1:asOtherIDs classCode="PAT">
          <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.2017.2.5.45" extension="069dc839-8fdf-4908-88d8-a985c1a42779" assigningAuthorityName="XDS Affinity Domain"/>
          <ns1:statusCode code="active"/>
          <ns1:scopingOrganization classCode="ORG" determinerCode="INSTANCE">
           <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.2017.2.5.45"/>
          </ns1:scopingOrganization>
         </ns1:asOtherIDs>
         <ns1:asOtherIDs classCode="PAT">
          <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.2017.2.5.65" extension="TIE4873" assigningAuthorityName="ISO"/>
          <ns1:statusCode code="active"/>
          <ns1:scopingOrganization classCode="ORG" determinerCode="INSTANCE">
           <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.2017.2.5.65"/>
          </ns1:scopingOrganization>
         </ns1:asOtherIDs>
        </ns1:patientPerson>
        <ns1:providerOrganization classCode="ORG" determinerCode="INSTANCE">
         <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.13.20.2000"/>
         <ns1:contactParty classCode="CON"/>
        </ns1:providerOrganization>
        <ns1:subjectOf1>
         <ns1:queryMatchObservation classCode="COND" moodCode="EVN">
          <ns1:code xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:CD" code="IHE_PDQ"/>
          <ns1:value xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:INT" value="100"/>
         </ns1:queryMatchObservation>
        </ns1:subjectOf1>
       </ns1:patient>
      </ns1:subject1>
      <ns1:custodian typeCode="CST">
       <ns1:assignedEntity classCode="ASSIGNED">
        <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.2017.2.5.36"/>
        <ns1:assignedOrganization classCode="ORG" determinerCode="INSTANCE">
         <ns1:name xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:EN">
          <ns1:given>org</ns1:given>
         </ns1:name>
        </ns1:assignedOrganization>
       </ns1:assignedEntity>
      </ns1:custodian>
     </ns1:registrationEvent>
    </ns1:subject>
    <ns1:queryAck>
     <ns1:queryId xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="32adda44-a2a6-457f-84da-6982aa1ae921"/>
     <ns1:statusCode code="deliveredResponse"/>
     <ns1:queryResponseCode code="OK"/>
     <ns1:resultTotalQuantity xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:INT" value="1"/>
     <ns1:resultCurrentQuantity xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:INT" value="1"/>
     <ns1:resultRemainingQuantity xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:INT" value="0"/>
    </ns1:queryAck>
    <ns1:queryByParameter>
     <ns1:queryId xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="32adda44-a2a6-457f-84da-6982aa1ae921"/>
     <ns1:statusCode code="new"/>
     <ns1:responseModalityCode code="R"/>
     <ns1:responsePriorityCode code="I"/>
     <ns1:initialQuantity xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:INT" value="200"/>
     <ns1:parameterList>
      <ns1:livingSubjectName>
       <ns1:value xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:EN">
        <ns1:family>Maiden</ns1:family>
       </ns1:value>
       <ns1:semanticsText>LivingSubject.name</ns1:semanticsText>
      </ns1:livingSubjectName>
      <ns1:patientAddress>
       <ns1:value xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:AD">
        <ns1:streetAddressLine>Ruelle de la Tour</ns1:streetAddressLine>
       </ns1:value>
       <ns1:semanticsText>Patient.addr</ns1:semanticsText>
      </ns1:patientAddress>
     </ns1:parameterList>
    </ns1:queryByParameter>
   </ns1:controlActProcess>
  </ns1:PRPA_IN201306UV02>
 </soapenv:Body>
</soapenv:Envelope>
