ESBComponents/MessageValidator/src/test/resources/testdata/pd/PD_Valid_ResponseMsg.xml

<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://www.w3.org/2005/08/addressing/anonymous</To><Action xmlns="http://www.w3.org/2005/08/addressing">urn:hl7-org:v3:PRPA_IN201306UV02:CrossGatewayPatientDiscovery</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:17b996aa-e0b9-4592-b3c5-5a9f6cb76018</MessageID><RelatesTo xmlns="http://www.w3.org/2005/08/addressing">uuid:e2a8d2d7-1ece-4930-9b4f-3868f5a4022e</RelatesTo><wsse:Security S:mustUnderstand="true"><wsu:Timestamp xmlns:ns15="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns14="http://schemas.xmlsoap.org/soap/envelope/" wsu:Id="_1"><wsu:Created>2012-03-27T18:19:13Z</wsu:Created><wsu:Expires>2012-03-27T18:24:13Z</wsu:Expires></wsu:Timestamp><wsse11:SignatureConfirmation xmlns:ns15="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns14="http://schemas.xmlsoap.org/soap/envelope/" wsu:Id="_5002" Value="ckoZQgg/iPU0xZUUf7TLHBF+MGNm633eEgjI6kHk10pv4/+RwSrFICPkAyd49Rpg5L1wHMVcYACPGi/WffNM9I6S0J8sM9tgHAevZCTBSyKYx2WW74GIM8ftatGxeUHyA2KcwVeWXGwQmjfvY4J2bl7zJNCOuJx62DjzOin17g3rVPv/7114H4RGUmMcU9DIUuR5fQlscLcqcXzGat7NWexfpSiw4seuVqz9NwLPx8RD5bkU2GiVUVHVU0BwRk300xAH0e/Bv4228ziSfN0ASzWrt/6OQCIHUiPFq1Wz+Ammzwhi8YV/V3SVatH23mZNbceC7yqMnfajSyDQoo1pKw==" /></wsse:Security></S:Header><S:Body><PRPA_IN201306UV02 xmlns="urn:hl7-org:v3" xmlns:ns2="urn:gov:hhs:fha:nhinc:common:nhinccommon" xmlns:ns3="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:ns4="urn:gov:hhs:fha:nhinc:common:patientcorrelationfacade" ITSVersion="XML_1.0"><id extension="-31758b04:1353509dd58:409f" root="2.16.840.1.113883.0.101"/><creationTime value="201232718199"/><interactionId extension="PRPA_IN201306UV" root="2.16.840.1.113883.1.6"/><processingCode code="P"/><processingModeCode code="R"/><acceptAckCode code="AL"/><receiver typeCode="RCV"><device determinerCode="INSTANCE" classCode=""><id root="1.2.345.678.999"/><asAgent classCode="AGNT"><representedOrganization determinerCode="INSTANCE" classCode="ORG"><id root="2.16.840.1.113883.0.213"/></representedOrganization></asAgent></device></receiver><sender typeCode="SND"><device determinerCode="INSTANCE" classCode=""><id root="1.2.345.678.999"/><asAgent classCode="AGNT"><representedOrganization determinerCode="INSTANCE" classCode="ORG"><id root="2.16.840.1.113883.0.101"/></representedOrganization></asAgent></device></sender><acknowledgement><typeId extension="PRPA_IN201305UV02" root="2.16.840.1.113883.1.6"/><typeCode code="AA"/><targetMessage xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/></acknowledgement><controlActProcess moodCode="EVN" classCode=""><code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV"/><authorOrPerformer typeCode="AUT"><assignedDevice classCode=""><id root="2.16.840.1.113883.0.101"/></assignedDevice></authorOrPerformer><subject typeCode="SUBJ"><registrationEvent moodCode="" classCode=""><id nullFlavor="NA"/><statusCode code="active"/><subject1 typeCode=""><patient classCode="PAT"><id extension="RI1.101.00037" root="2.16.840.1.113883.0.101"/><statusCode code="SD"/><patientPerson><name><family partType="FAM">Marquez</family><given partType="GIV">Marta</given></name><telecom value="tel:+1-987-555-9000"/><administrativeGenderCode code="F"/><birthTime value="19701001"/><addr><streetAddressLine>19591 Springs Pl</streetAddressLine><city>Atlanta</city><state>GA</state><postalCode>30345</postalCode></addr><asOtherIDs classCode="SD"><id extension="666660037" root="2.16.840.1.113883.4.1"/><scopingOrganization determinerCode="" classCode=""><id root="2.16.840.1.113883.4.1"/></scopingOrganization></asOtherIDs></patientPerson><providerOrganization determinerCode="" classCode=""><id root="2.16.840.1.113883.0.101"/><contactParty xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/></providerOrganization><subjectOf1><queryMatchObservation moodCode="" classCode=""><code code="IHE_PDQ"/><value xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="INT" value="100"/></queryMatchObservation></subjectOf1></patient></subject1><custodian typeCode=""><assignedEntity classCode=""><id root="2.16.840.1.113883.0.101"/></assignedEntity></custodian></registrationEvent></subject><queryAck><queryId extension="-abd3453dcd24wkkks545" root="2.16.840.1.113883.0.213"/><queryResponseCode code="OK"/><resultTotalQuantity value="1"/><resultCurrentQuantity value="1"/><resultRemainingQuantity value="0"/></queryAck><queryByParameter xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"><queryId extension="-abd3453dcd24wkkks545" root="2.16.840.1.113883.0.213"/><statusCode code="new"/><responseModalityCode code="R"/><responsePriorityCode code="I"/><parameterList><livingSubjectAdministrativeGender><value code="F"/><semanticsText representation="TXT"/></livingSubjectAdministrativeGender><livingSubjectBirthTime><value value="19701001"/><semanticsText representation="TXT"/></livingSubjectBirthTime><livingSubjectId><value extension="KET21300037" root="2.16.840.1.113883.0.213"/><semanticsText representation="TXT"/></livingSubjectId><livingSubjectName><value><family partType="FAM">Marquez</family><given partType="GIV">Marta</given></value><semanticsText representation="TXT"/></livingSubjectName><patientAddress><value/></patientAddress></parameterList></queryByParameter></controlActProcess></PRPA_IN201306UV02></S:Body></S:Envelope>